acc1408/stm8s_osa/src/stm8s_i2clcd1602.c
/**
  ******************************************************************************
  * @file    stm8s_delay.h
  * @author  Salnikov Aleksey
  * @version V1.0.0
  * @date    31-07-2019
  * @brief   This file contains all functions prototype and macros for the program Delay.
   ******************************************************************************
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM8S_I2CLCD1602_C
#define __STM8S_I2CLCD1602_C

/* Includes ------------------------------------------------------------------*/
#include "inc/stm8s_i2clcd1602.h"


void LcdSendByte(SetLCD_t *lcd, LcdDataCom_t data1_com0,uint8_t data)
{
	while(i2cCheckStatusTransfer());
	lcd->bit[0].rs=data1_com0;
	lcd->bit[0].rw=0;
	lcd->bit[0].e=1;
	lcd->bit[0].bl=lcd->Backlight;
	lcd->bit[0].db4=data>>4;
	//-------
	lcd->data[1]=lcd->data[0];
	lcd->bit[1].e=0;
	//Ïðåäâàðòåëüíàÿ Íàñòðîéêà 4 áèòíîãî ðåæèìà
	lcd->data[2]=lcd->data[0];
	lcd->bit[2].db4=data;
	lcd->data[3]=lcd->data[2];
	lcd->bit[3].e=0;
	I2C_MasterSendSend(lcd->Address, lcd->data, 4,lcd->data,0); 
	delay_us(40);
}

void Lcdi2cPrint(SetLCD_t *lcd, char *st)
{
	
	while(*st)
	{
		LcdSendByte(lcd,1,*st++);
	}
}


void LcdClearDisplay(SetLCD_t *lcd)
{
	LcdSendByte(lcd, LcdCom, 0b1);
	//delay_ms(40);
}


void LcdCursorLeft(SetLCD_t *lcd)
{
	LcdSendByte(lcd, LcdCom, 0b10000);
	//delay_ms(40);
}
void LcdCursorRight(SetLCD_t *lcd)
{
	LcdSendByte(lcd, LcdCom, 0b10100);
	//delay_ms(40);
}

void LcdCursorSet(SetLCD_t *lcd, uint8_t num)
{
	num&=0b01111111;
	switch(num/40)
	{
		case 0:
		case 2:
		num=num%40;
		break;
		case 1:
		case 3:
		num=num%40;
		num|=0b01000000;
		break;
	}
	num|=0b10000000;
	LcdSendByte(lcd, LcdCom, num);
	//delay_ms(40);
}

void CursorGoTo(SetLCD_t *lcd, uint8_t x, uint8_t y)
{
uint8_t data=(1<<7);
switch(x%4)
{
case 0: data|=y%20;
		break;
case 1: data|=y%20+0x40;
		break;
case 2: data|=y%20+0x14;
		break;
case 3: data|=y%20+0x54;
		break;
}
LcdSendByte(lcd, LcdCom, data);
	//delay_ms(40);
}

void LcdDisplayLeft(SetLCD_t *lcd)
{
	LcdSendByte(lcd, LcdCom, 0b11000);
	//delay_ms(40);
}
void LcdDisplayRight(SetLCD_t *lcd)
{
	LcdSendByte(lcd, LcdCom, 0b11100);
	//delay_ms(40);
}

void LcdWriteUserChar(SetLCD_t *lcd, uint8_t kod, uint8_t *st)
{
	uint8_t i;
	kod=kod&0b111;
	LcdSendByte(lcd,0,0x40|kod);
	for(i=0;i<8;i++)
	LcdSendByte(lcd,1,*st++);
	LcdSendByte(lcd,0,0x80);
}


void Lcdi2cInit(SetLCD_t *lcd, 
								uint8_t Address, 
								FunctionalState Backlight,
								FunctionalState BlinkOnOff,
								FunctionalState CursorOnOff)
{
	//I2C_Init_7bit(100000);
	//I2C_ITConfig(I2C_IT_ERR|I2C_IT_EVT|I2C_IT_BUF, ENABLE);
	//I2C_Cmd(ENABLE);						
	
	Init_Delay();
	
	lcd->Address=Address;
	lcd->Backlight=Backlight;
	lcd->ID_cursorShiftRightLeft=LcdAddOne;
	lcd->S_ScreenShiftOnOff=DISABLE;
	//---------------
	lcd->B_BlinkOnOff=BlinkOnOff;
	lcd->C_CursorOnOff=CursorOnOff;
	lcd->D_DisplayOnOff=ENABLE;
	lcd->F_font=LcdFont5x8;
	lcd->N_lines=LcdLine2;
	LcdSendByte(lcd, 0,0b00110010);
	LcdSendByte(lcd,0,1<<2|lcd->ID_cursorShiftRightLeft<<1|lcd->S_ScreenShiftOnOff);
	LcdSendByte(lcd,0,1<<3|lcd->D_DisplayOnOff<<2|lcd->C_CursorOnOff<<1|lcd->B_BlinkOnOff);
	LcdSendByte(lcd,0,1<<5|lcd->N_lines<<3|lcd->F_font<<2);
}


/*
const char smile[] = 
{
	0x7e, 0x11, 0x11, 0x11, 0x7e,//A	0x90
	0x7f, 0x49, 0x49, 0x49, 0x33,//Ð‘	0x91
	0x7f, 0x49, 0x49, 0x49, 0x36,//Ð’	0x92
	0x7f, 0x01, 0x01, 0x01, 0x03,//Ð“	0x93
	0xe0, 0x51, 0x4f, 0x41, 0xff,//Ð”	0x94
	0x7f, 0x49, 0x49, 0x49, 0x41,//E	0x95
	0x77, 0x08, 0x7f, 0x08, 0x77,//Ð–	0x96
	0x41, 0x49, 0x49, 0x49, 0x36,//Ð—	0x97
	0x7f, 0x10, 0x08, 0x04, 0x7f,//Ð˜	0x98
	0x7c, 0x21, 0x12, 0x09, 0x7c,//Ð™	0x99
	0x7f, 0x08, 0x14, 0x22, 0x41,//K	0x9A
	0x20, 0x41, 0x3f, 0x01, 0x7f,//Ð›	0x9B
	0x7f, 0x02, 0x0c, 0x02, 0x7f,//M	0x9C
	0x7f, 0x08, 0x08, 0x08, 0x7f,//H	0x9D
	0x3e, 0x41, 0x41, 0x41, 0x3e,//O	0x9E
	0x7f, 0x01, 0x01, 0x01, 0x7f,//ÐŸ	0x9F
	0x7f, 0x09, 0x09, 0x09, 0x06,//P	0xA0
	0x3e, 0x41, 0x41, 0x41, 0x22,//C	0xA1
	0x01, 0x01, 0x7f, 0x01, 0x01,//T	0xA2
	0x47, 0x28, 0x10, 0x08, 0x07,//Ð£	0xA3
	0x1c, 0x22, 0x7f, 0x22, 0x1c,//Ð¤	0xA4
	0x63, 0x14, 0x08, 0x14, 0x63,//X	0xA5
	0x7f, 0x40, 0x40, 0x40, 0xff,//Ð¦	0xA6
	0x07, 0x08, 0x08, 0x08, 0x7f,//Ð§	0xA7
	0x7f, 0x40, 0x7f, 0x40, 0x7f,//Ð¨	0xA8
	0x7f, 0x40, 0x7f, 0x40, 0xff,//Ð©	0xA9
	0x01, 0x7f, 0x48, 0x48, 0x30,//Ðª	0xAA
	0x7f, 0x48, 0x30, 0x00, 0x7f,//Ð«	0xAB
	0x00, 0x7f, 0x48, 0x48, 0x30,//Ð­	0xAC
	0x22, 0x41, 0x49, 0x49, 0x3e,//Ð¬	0xAD
	0x7f, 0x08, 0x3e, 0x41, 0x3e,//Ð®	0xAE
	0x46, 0x29, 0x19, 0x09, 0x7f,//Ð¯	0xAF
// Ð¼Ð°Ð»ÐµÐ½ÑŒÐºÐ¸Ðµ Ð±ÑƒÐºÐ²Ñ‹ 
 	0x20, 0x54, 0x54, 0x54, 0x78,//a	0xB0
	0x3c, 0x4a, 0x4a, 0x49, 0x31,//Ð±	0xB1
	0x7c, 0x54, 0x54, 0x28, 0x00,//Ð²	0xB2
	0x7c, 0x04, 0x04, 0x04, 0x0c,//Ð³	0xB3
	0xe0, 0x54, 0x4c, 0x44, 0xfc,//Ð´	0xB4
	0x38, 0x54, 0x54, 0x54, 0x18,//e	0xB5
	0x6c, 0x10, 0x7c, 0x10, 0x6c,//Ð¶	0xB6
	0x44, 0x44, 0x54, 0x54, 0x28,//Ð·	0xB7
	0x7c, 0x20, 0x10, 0x08, 0x7c,//Ð¸	0xB8
	0x7c, 0x41, 0x22, 0x11, 0x7c,//Ð¹	0xB9
	0x7c, 0x10, 0x28, 0x44, 0x00,//Ðº	0xBA
	0x20, 0x44, 0x3c, 0x04, 0x7c,//Ð»	0xBB
	0x7c, 0x08, 0x10, 0x08, 0x7c,//Ð¼	0xBC
	0x7c, 0x10, 0x10, 0x10, 0x7c,//Ð½	0xBD
	0x38, 0x44, 0x44, 0x44, 0x38,//o	0xBE
	0x7c, 0x04, 0x04, 0x04, 0x7c //Ð¿	0xBF
};
*/
/*
bit8_t data;
uint8_t temp;
uint8_t i=0,k,y;
uint16_t j;
void SetChar(void)
{
	//LcdSendByte(0,0x40);
		
	for (k=0;k<30;k++)
	{
		LcdSendByte(0,0x40);
		for(i=0;i<8;i++)
		{
			temp=0;
			y=0;
			for(j=k*5;j<(k*5+5);j++)
			{
				temp|=((smile[j]>>i)&(1))<<(4-y);
				y++;
			}
			LcdSendByte(1,temp);
		}
	LcdSendByte(0,0x80|k);
	LcdSendByte(1,0);
	//LcdSendByte(1,1);
	}
}
*/




//-----------------------
#endif 